# Nicholas Early
## Week 12
### Python Pandas Series

In [36]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [37]:
s = Series([2,5,6,-9,8,4])

s

0    2
1    5
2    6
3   -9
4    8
5    4
dtype: int64

In [38]:
s.values

array([ 2,  5,  6, -9,  8,  4], dtype=int64)

In [39]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [40]:
summer_olympics = Series([2520,1122,937,847,713],index=['USA','Russia','Germany','UK','France'])

summer_olympics

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [41]:
summer_olympics['USA']

2520

In [42]:
summer_olympics[summer_olympics>800]

USA        2520
Russia     1122
Germany     937
UK          847
dtype: int64

In [43]:
'USA' in summer_olympics

True

In [44]:
#convert series to dictionary
summer_olympics_dict = summer_olympics.to_dict()

summer_olympics_dict

{'USA': 2520, 'Russia': 1122, 'Germany': 937, 'UK': 847, 'France': 713}

In [45]:
summer_olympics_series = Series(summer_olympics_dict)

summer_olympics_series

USA        2520
Russia     1122
Germany     937
UK          847
France      713
dtype: int64

In [46]:
countries = ['USA','Germany','France','Russia','UK','Argentina','Italy']

In [47]:
#Redefine a Series

s2 = Series(summer_olympics_dict,index=countries)

s2

USA          2520.0
Germany       937.0
France        713.0
Russia       1122.0
UK            847.0
Argentina       NaN
Italy           NaN
dtype: float64

In [48]:
pd.isnull(s2)

USA          False
Germany      False
France       False
Russia       False
UK           False
Argentina     True
Italy         True
dtype: bool

In [49]:
summer_olympics_series + s2

Argentina       NaN
France       1426.0
Germany      1874.0
Italy           NaN
Russia       2244.0
UK           1694.0
USA          5040.0
dtype: float64

In [50]:
s2.name = 'Summer Olympics'

In [51]:
s2

USA          2520.0
Germany       937.0
France        713.0
Russia       1122.0
UK            847.0
Argentina       NaN
Italy           NaN
Name: Summer Olympics, dtype: float64

In [52]:
s2.index.name='Countries'

In [53]:
s2

Countries
USA          2520.0
Germany       937.0
France        713.0
Russia       1122.0
UK            847.0
Argentina       NaN
Italy           NaN
Name: Summer Olympics, dtype: float64

In [54]:
#DataFrame

data_dict = {'states': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
             'year': [2000,2001,2002,2001,2002,2003],
             'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
df = pd.DataFrame(data_dict)
df

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [55]:
df.head()

   states  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [56]:
df.tail()

   states  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [57]:
pd.DataFrame(data_dict, columns=['year','states','pop'])

   year  states  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [58]:
df2 = pd.DataFrame(data_dict, columns=['year','states','pop','debt'], index=['one','two','three','four','five','six'])
df2

       year  states  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [24]:
df2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [25]:
df2.loc['three']

year      2002
states    Ohio
pop        3.6
debt       NaN
Name: three, dtype: object

In [26]:
df2['debt'] = 10.5
df2

       year  states  pop  debt
one    2000    Ohio  1.5  10.5
two    2001    Ohio  1.7  10.5
three  2002    Ohio  3.6  10.5
four   2001  Nevada  2.4  10.5
five   2002  Nevada  2.9  10.5
six    2003  Nevada  3.2  10.5

In [27]:
df2['debt'] = np.arange(6.)
df2

       year  states  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [28]:
s3 = Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [29]:
df2['debt']=s3

In [30]:
df2

       year  states  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [31]:
#nested dictionary
pop_dict = {'Nevada':{2001: 2.4, 2002: 2.9},
           'Ohio': {2000: 1.5, 2001: 1.7, 2002:3.6}}
pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [32]:
df3 = pd.DataFrame(pop_dict)
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [33]:
DataFrame(df3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [34]:
df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [35]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [59]:
df2.columns

Index(['year', 'states', 'pop', 'debt'], dtype='object')

In [60]:
df2['easetern'] = s3

In [61]:
df2.columns

Index(['year', 'states', 'pop', 'debt', 'easetern'], dtype='object')

In [63]:
del df2['easetern']

In [66]:
# set index and coluimns their name attributes
df3.index.name= 'year'; df3.columns.name = 'state'